// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// let result = "";
// for (i = 20; i <= 30; i += 0.5) {
//   result += i + " ";
// }
// console.log(result);

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// let oneDollar = 27;
// for (i = 10; i <= 100; i += 10) {
//   console.log(i * oneDollar);
// }

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let N = 3333;
for (i = 1; i <= 100; i++) {
  if (i * i <= N) {
    console.log(i);
  } else {
    break;
  }
}

// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

function test_prime(n) {
  for (i = 2; i < n; i++) {
    if (n % i === 0) {
      return false;
    } else {
      return true;
    }
  }
}
console.log(test_prime(14));
// Знайти суму всіх цілих чисел від 1 до 15.
// let sum = 1;
// for (i = 1; i <= 15; i++) {
//   sum += i;
// }
// console.log(sum);

// Знайти добуток усіх цілих чисел від 15 до 35.
// let mult = 15;
// for (i = 15; i <= 35; i++) {
//   mult *= i;
// }
// console.log(mult);

// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// let total = 1;
// let quant = 500;
// for (i = 1; i <= 500; i++) {
//   total += i;
// }
// average = total / quant;
// console.log(average);

// Вивести суму лише парних чисел в діапазоні від 30 до 80.
// let sum = 0;
// for (i = 30; i <= 80; i += 2) {
//   sum += i;
// }
// console.log(sum);

// Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// for (i = 100; i <= 200; i++) {
//   if (i % 3 === 0) {
//     console.log(i);
//   }
// }

// Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// const n = 10;
// for (let i = 0; i <= n; i++) {
//   if (n % i === 0) {
//     console.log(i);
//   }
// }

// Визначити кількість його парних дільників.
// const n = 10;
// let evenNum = 0;
// for (let i = 0; i <= n; i++) {
//   if (n % i === 0 && i % 2 === 0) {
//     evenNum += 1;
//   }
// }
// console.log(evenNum);

// Знайти суму його парних дільників.
// const n = 10;
// let sum = 0;
// for (let i = 0; i <= n; i++) {
//   if (n % i === 0 && i % 2 === 0) {
//     sum += i;
//   }
// }
// console.log(sum);

// Надрукувати повну таблицю множення від 1 до 10.
// for (let i = 1; i <= 10; i++) {
//   for (let j = 1; j <= 10; j++) {
//     console.log(`${i} x ${j} = ${i * j}`);
//   }
//   console.log("");
// }
